# CCNA CCENT Studying

I. Chapter 1
  A. TCP/IP and OSI Model: Data Encapsulation (Page 6) 
    1. Application: End-User Input "DATA"
    2. Transport (Segment): Data encapsulated with TCP, (TCP) encapsulated with TCP Header 
    3. Network (Router): Connect Networks, (TCP + DATA) encapsulated with "IP Header" Packets = (IP + TCP + DATA)
    4. Data Link (Switch): Connect End-Users, (IP + TCP + DATA) encapsulated with Frames = (IP + TCP + DATA + FRAME), 
       Frames contain Mac Addresses
      a. Retains the last 10 commands
      b. Frames contain "MAC Addresses"
      c. Purpose is to learn Mac Addresses
      d. 
    5. Physical (Hub): Connect End-Users, Problem "Collisions", Sent as Bits
      a. 
  B. Packet Tracer
    1. Configuration
      a. RED connection on PT = Port Shut by Default
    2. TCP/IP
    3. Switch Commands 
      a. "enable" = Privilege Mode
      b. "conf t" = Configure Terminal
      c. "int fa0/10" = Configure Interface
      d. "?" = list command line options
      e. "clear mac-address-table" = clear table
      f. "sh mac-a" = show 
    4. PC (End-User) Commands
      a. PC-PT-PC2: ping 192.168.12,13,11,10
      b. Switch Mac Address Table Output (Two entries from the Hub)

Switch#sh mac-address-table 
          Mac Address Table
-------------------------------------------

Vlan    Mac Address       Type        Ports
----    -----------       --------    -----

   1    0006.2ae7.2257    DYNAMIC     Fa0/5
   1    000c.cfa7.9d64    DYNAMIC     Fa0/6
   1    0030.f294.5723    DYNAMIC     Fa0/10
   1    00d0.d3a4.ca91    DYNAMIC     Fa0/10

PC>arp -a
  Internet Address      Physical Address      Type
  192.168.1.10          0030.f294.5723        dynamic
  192.168.1.11          00d0.d3a4.ca91        dynamic
  192.168.1.12          000c.cfa7.9d64

**Purpose of Address Resolution Protocol (ARP)**

Layer 2 to Layer 3 Mapping
Lasts for 300 seconds
Error Detection happens with FCS to check Frame Integrity

II. Router CLI
  A. Setup Interface IP
    1. Configure Gigabit Interface

Router>enable
Router#conf t 
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int gi0/0
Router(config-if)#se
Router(config-if)#ip addr 
Router(config-if)#ip addr 192.168.1.1 ?
  A.B.C.D  IP subnet mask
Router(config-if)#ip addr 192.168.1.1 255.255.255.0 
Router(config-if)#no shut

Router(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0, changed state to up


Router(config)#int gi0/0
Router(config-if)#se
Router(config-if)#ip addr 
Router(config-if)#ip addr 192.168.1.1 ?
  A.B.C.D  IP subnet mask
Router(config-if)#ip addr 192.168.1.1 255.255.255.0 
Router(config-if)#no shut

Router(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0, changed state to up

Router(config-if)#
Router(config-if)#
Router(config-if)#int gi
Router(config-if)#int gi
Router(config-if)#int 
Router(config-if)#int 
Router(config-if)#sh

Router(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0, changed state to administratively down

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0, changed state to down

Router(config-if)#exit
Router(config)#int gi0/1
Router(config-if)#ip ad
Router(config-if)#ip address 192.168.2.1
% Incomplete command.
Router(config-if)#ip address 192.168.2.1 255.255.255.0
Router(config-if)#no shut

Router(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/1, changed state to up

Router(config-if)#int gi0/0
Router(config-if)#int gi0/0
Router(config-if)#ip addr 192.168.1.1 255.255.255.0
Router(config-if)#no shut

Router(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0, changed state to up

Router(config-if)#end
Router#
%SYS-5-CONFIG_I: Configured from console by console

Router#sh ip arp
Protocol  Address          Age (min)  Hardware Addr   Type   Interface
Internet  192.168.1.1             -   0030.A35D.B701  ARPA   GigabitEthernet0/0
Internet  192.168.1.10            6   0030.F294.5723  ARPA   GigabitEthernet0/0
Internet  192.168.1.11            7   00D0.D3A4.CA91  ARPA   GigabitEthernet0/0
Internet  192.168.1.12            6   000C.CFA7.9D64  ARPA   GigabitEthernet0/0
Internet  192.168.1.13            6   0006.2AE7.2257  ARPA   GigabitEthernet0/0
Internet  192.168.2.1             -   0030.A35D.B702  ARPA   GigabitEthernet0/1
Internet  192.168.2.10            7   00E0.8F19.6123  ARPA   GigabitEthernet0/1
Router#


Router#sh ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
       i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
       * - candidate default, U - per-user static route, o - ODR
       P - periodic downloaded static route

Gateway of last resort is not set

     192.168.1.0/24 is variably subnetted, 2 subnets, 2 masks
C       192.168.1.0/24 is directly connected, GigabitEthernet0/0
L       192.168.1.1/32 is directly connected, GigabitEthernet0/0
     192.168.2.0/24 is variably subnetted, 2 subnets, 2 masks
C       192.168.2.0/24 is directly connected, GigabitEthernet0/1
L       192.168.2.1/32 is directly connected, GigabitEthernet0/1
Router#

Router#sh ip int br
Interface              IP-Address      OK? Method Status                Protocol
 
GigabitEthernet0/0     192.168.1.1     YES manual up                    up
 
GigabitEthernet0/1     192.168.2.1     YES manual up                    up
 
GigabitEthernet0/2     unassigned      YES unset  administratively down down
 
Vlan1                  unassigned      YES unset  administratively down down

Router#sh run # Large Output of running configuration
Router#copy running-config startup-config


