# CCNA CCENT Studying

I. Chapter 1
  A. TCP/IP and OSI Model: Data Encapsulation (Page 6) 
    1. Application: End-User Input "DATA"
    2. Transport (Segment): Data encapsulated with TCP, (TCP) encapsulated with TCP Header 
    3. Network (Router): Connect Networks, (TCP + DATA) encapsulated with "IP Header" Packets = (IP + TCP + DATA)
    4. Data Link (Switch): Connect End-Users, (IP + TCP + DATA) encapsulated with Frames = (IP + TCP + DATA + FRAME), 
       Frames contain Mac Addresses
      a. Retains the last 10 commands
      b. Frames contain "MAC Addresses"
      c. Purpose is to learn Mac Addresses
      d. 
    5. Physical (Hub): Connect End-Users, Problem "Collisions", Sent as Bits
      a. 
  B. Packet Tracer
    1. Configuration
      a. RED connection on PT = Port Shut by Default
    2. TCP/IP
    3. Switch Commands 
      a. "enable" = Privilege Mode
      b. "conf t" = Configure Terminal
      c. "int fa0/10" = Configure Interface
      d. "?" = list command line options
      e. "clear mac-address-table" = clear table
      f. "sh mac-a" = show 
    4. PC (End-User) Commands
      a. PC-PT-PC2: ping 192.168.12,13,11,10
      b. Switch Mac Address Table Output (Two entries from the Hub)

Switch#sh mac-address-table 
          Mac Address Table
-------------------------------------------

Vlan    Mac Address       Type        Ports
----    -----------       --------    -----

   1    0006.2ae7.2257    DYNAMIC     Fa0/5
   1    000c.cfa7.9d64    DYNAMIC     Fa0/6
   1    0030.f294.5723    DYNAMIC     Fa0/10
   1    00d0.d3a4.ca91    DYNAMIC     Fa0/10

PC>arp -a
  Internet Address      Physical Address      Type
  192.168.1.10          0030.f294.5723        dynamic
  192.168.1.11          00d0.d3a4.ca91        dynamic
  192.168.1.12          000c.cfa7.9d64

**Purpose of Address Resolution Protocol (ARP)**

Layer 2 to Layer 3 Mapping
Lasts for 300 seconds
Error Detection happens with FCS to check Frame Integrity

II. Router CLI
  A. Setup Interface IP
    1. Configure Gigabit Interface

Router>enable
Router#conf t 
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int gi0/0
Router(config-if)#se
Router(config-if)#ip addr 
Router(config-if)#ip addr 192.168.1.1 ?
  A.B.C.D  IP subnet mask
Router(config-if)#ip addr 192.168.1.1 255.255.255.0 
Router(config-if)#no shut

Router(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0, changed state to up


