# CCNA CCENT Studying

I. Chapter 1
  A. TCP/IP and OSI Model: Data Encapsulation (Page 6) 
    1. Application: End-User Input "DATA"
    2. Transport (Segment): Data encapsulated with TCP, (TCP) encapsulated with TCP Header 
    3. Network (Router): Connect Networks, (TCP + DATA) encapsulated with "IP Header" Packets = (IP + TCP + DATA)
    4. Data Link (Switch): Connect End-Users, (IP + TCP + DATA) encapsulated with Frames = (IP + TCP + DATA + FRAME), 
       Frames contain Mac Addresses
      a. Retains the last 10 commands
      b. Frames contain "MAC Addresses"
      c. Purpose is to learn Mac Addresses
      d. 
    5. Physical (Hub): Connect End-Users, Problem "Collisions", Sent as Bits
      a. 
  B. Packet Tracer
    1. Configuration
      a. RED connection on PT = Port Shut by Default
    2. TCP/IP
    3. Switch Commands 
      a. "enable" = Privilege Mode
      b. "conf t" = Configure Terminal
      c. "int fa0/10" = Configure Interface
      d. "?" = list command line options
      e. "clear mac-address-table" = clear table
      f. "sh mac-a" = show 
    4. PC (End-User) Commands
      a. PC-PT-PC2: ping 192.168.12,13,11,10
      b. Switch Mac Address Table Output (Two entries from the Hub)

Switch#sh mac-address-table 
          Mac Address Table
-------------------------------------------

Vlan    Mac Address       Type        Ports
----    -----------       --------    -----

   1    0006.2ae7.2257    DYNAMIC     Fa0/5
   1    000c.cfa7.9d64    DYNAMIC     Fa0/6
   1    0030.f294.5723    DYNAMIC     Fa0/10
   1    00d0.d3a4.ca91    DYNAMIC     Fa0/10

PC>arp -a
  Internet Address      Physical Address      Type
  192.168.1.10          0030.f294.5723        dynamic
  192.168.1.11          00d0.d3a4.ca91        dynamic
  192.168.1.12          000c.cfa7.9d64

**Purpose of Address Resolution Protocol (ARP)**

Layer 2 to Layer 3 Mapping
Lasts for 300 seconds
Error Detection happens with FCS to check Frame Integrity

II. Router CLI
  A. Setup Interface IP
    1. Configure Gigabit Interface

Router>enable
Router#conf t 
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int gi0/0
Router(config-if)#se
Router(config-if)#ip addr 
Router(config-if)#ip addr 192.168.1.1 ?
  A.B.C.D  IP subnet mask
Router(config-if)#ip addr 192.168.1.1 255.255.255.0 
Router(config-if)#no shut

Router(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0, changed state to up


Router(config)#int gi0/0
Router(config-if)#se
Router(config-if)#ip addr 
Router(config-if)#ip addr 192.168.1.1 ?
  A.B.C.D  IP subnet mask
Router(config-if)#ip addr 192.168.1.1 255.255.255.0 
Router(config-if)#no shut

Router(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0, changed state to up

Router(config-if)#
Router(config-if)#
Router(config-if)#int gi
Router(config-if)#int gi
Router(config-if)#int 
Router(config-if)#int 
Router(config-if)#sh

Router(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0, changed state to administratively down

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0, changed state to down

Router(config-if)#exit
Router(config)#int gi0/1
Router(config-if)#ip ad
Router(config-if)#ip address 192.168.2.1
% Incomplete command.
Router(config-if)#ip address 192.168.2.1 255.255.255.0
Router(config-if)#no shut

Router(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/1, changed state to up

Router(config-if)#int gi0/0
Router(config-if)#int gi0/0
Router(config-if)#ip addr 192.168.1.1 255.255.255.0
Router(config-if)#no shut

Router(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0, changed state to up

Router(config-if)#end
Router#
%SYS-5-CONFIG_I: Configured from console by console

Router#sh ip arp
Protocol  Address          Age (min)  Hardware Addr   Type   Interface
Internet  192.168.1.1             -   0030.A35D.B701  ARPA   GigabitEthernet0/0
Internet  192.168.1.10            6   0030.F294.5723  ARPA   GigabitEthernet0/0
Internet  192.168.1.11            7   00D0.D3A4.CA91  ARPA   GigabitEthernet0/0
Internet  192.168.1.12            6   000C.CFA7.9D64  ARPA   GigabitEthernet0/0
Internet  192.168.1.13            6   0006.2AE7.2257  ARPA   GigabitEthernet0/0
Internet  192.168.2.1             -   0030.A35D.B702  ARPA   GigabitEthernet0/1
Internet  192.168.2.10            7   00E0.8F19.6123  ARPA   GigabitEthernet0/1
Router#


Router#sh ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
       i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
       * - candidate default, U - per-user static route, o - ODR
       P - periodic downloaded static route

Gateway of last resort is not set

     192.168.1.0/24 is variably subnetted, 2 subnets, 2 masks
C       192.168.1.0/24 is directly connected, GigabitEthernet0/0
L       192.168.1.1/32 is directly connected, GigabitEthernet0/0
     192.168.2.0/24 is variably subnetted, 2 subnets, 2 masks
C       192.168.2.0/24 is directly connected, GigabitEthernet0/1
L       192.168.2.1/32 is directly connected, GigabitEthernet0/1
Router#

Router#sh ip int br
Interface              IP-Address      OK? Method Status                Protocol
 
GigabitEthernet0/0     192.168.1.1     YES manual up                    up
 
GigabitEthernet0/1     192.168.2.1     YES manual up                    up
 
GigabitEthernet0/2     unassigned      YES unset  administratively down down
 
Vlan1                  unassigned      YES unset  administratively down down

Router#sh run # Large Output of running configuration
Router#copy running-config startup-config

SW1#
%SYS-5-CONFIG_I: Configured from console by console

SW1#sh vlan

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Fa0/1, Fa0/2, Fa0/3, Fa0/4
                                                Fa0/5, Fa0/6, Fa0/7, Fa0/8
                                                Fa0/9, Fa0/10, Fa0/11, Fa0/12
                                                Fa0/13, Fa0/14, Fa0/15, Fa0/16
                                                Fa0/17, Fa0/18, Fa0/19, Fa0/20
                                                Fa0/21, Fa0/22, Fa0/23, Fa0/24
                                                Gig0/1, Gig0/2
1002 fddi-default                     act/unsup 
1003 token-ring-default               act/unsup 
1004 fddinet-default                  act/unsup 
1005 trnet-default                    act/unsup 

VLAN Type  SAID       MTU   Parent RingNo BridgeNo Stp  BrdgMode Trans1 Trans2
---- ----- ---------- ----- ------ ------ -------- ---- -------- ------ ------
1    enet  100001     1500  -      -      -        -    -        0      0
1002 fddi  101002     1500  -      -      -        -    -        0      0   
1003 tr    101003     1500  -      -      -        -    -        0      0   
1004 fdnet 101004     1500  -      -      -        ieee -        0      0   
1005 trnet 101005     1500  -      -      -        ibm  -        0      0   

Remote SPAN VLANs
------------------------------------------------------------------------------


Primary Secondary Type              Ports
------- --------- ----------------- ------------------------------------------


## All ports belong to VLAN 1 by Default

## Layer 1 Security

Switch>enable
Switch#configure terminal
Switch(config)#hostname SW1
SW1#
SW1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
SW1(config)#int vlan 1
SW1(config-if)#ip addr 192.168.1.2 255.255.255.0
SW1(config-if)#no shut

SW1(config-if)#
%LINK-5-CHANGED: Interface Vlan1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan1, changed state to up

SW1(config-if)#
SW1(config-if)#exit
SW1(config)#ip default-gateway 192.168.1.1
SW1(config)#banner mot #AUTHORIZE PERSONNEL ONLY#
SW1(config)#enable ?
  password  Assign the privileged level password
  secret    Assign the privileged level secret
SW1(config)#enable pas
SW1(config)#enable pas
SW1(config)#enable password cisco
SW1(config)#enable se
SW1(config)#enable secret global
SW1(config)#line con 0
SW1(config-line)#password console
SW1(config-line)#login
SW1(config-line)#line vty 0 4
SW1(config-line)#password vty
SW1(config-line)#login
SW1(config-line)#
SW1>en
Password: 
SW1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
SW1(config)#
SW1(config)#service password-encryption
SW1(config)#

Switch>enable
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname SW2
SW2(config)#
SW2(config)#end
SW2#copy running-config startup-config
Destination filename [startup-config]? 
Building configuration...
[OK]
SW2#
%SYS-5-CONFIG_I: Configured from console by console

SW2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
SW2(config)#int vlan 1 
SW2(config-if)#ip addr 192.168.2.2 255.255.255.0
SW2(config-if)#no shut

SW2(config-if)#
%LINK-5-CHANGED: Interface Vlan1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan1, changed state to up

SW2(config-if)#
SW2(config-if)#exit
SW2(config)#ip def
SW2(config)#ip default-gateway 192.168.2.1
SW2(config)#
SW2(config)#banner mot #AUTHORIZE PERSONNEL ONLY#
SW2(config)#enable password cisco
SW2(config)#enable secret global 
SW2(config)#line con 0
SW2(config-line)#password console
SW2(config-line)#login
SW2(config-line)#line vty 0 4 
SW2(config-line)#password vty
SW2(config-line)#login
SW2(config-line)#

## Port Security - Layer 2 Security

SW1>en
Password: 
SW1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
SW1(config)#int ran
SW1(config)#int range fa0/5 - 6
SW1(config-if-range)#sw
SW1(config-if-range)#switchport m
SW1(config-if-range)#switchport mode 
% Incomplete command.
SW1(config-if-range)#mode acc
SW1(config-if-range)#mode acce
SW1(config-if-range)#mode access
SW1(config-if-range)#mode access
                      ^
% Invalid input detected at '^' marker.
	
SW1(config-if-range)#switchport mode ?
  access   Set trunking mode to ACCESS unconditionally
  dynamic  Set trunking mode to dynamically negotiate access or trunk mode
  trunk    Set trunking mode to TRUNK unconditionally
SW1(config-if-range)#switchport mode ?
  access   Set trunking mode to ACCESS unconditionally
  dynamic  Set trunking mode to dynamically negotiate access or trunk mode
  trunk    Set trunking mode to TRUNK unconditionally
SW1(config-if-range)#switchport mode ac
SW1(config-if-range)#switchport mode access 
SW1(config-if-range)#switchport por
SW1(config-if-range)#switchport port-security 
SW1(config-if-range)#?
  cdp               Global CDP configuration subcommands
  channel-group     Etherchannel/port bundling configuration
  channel-protocol  Select the channel protocol (LACP, PAgP)
  description       Interface specific description
  duplex            Configure duplex operation.
  exit              Exit from interface configuration mode
  ip                Interface Internet Protocol config commands
  mdix              Set Media Dependent Interface with Crossover
  mls               mls interface commands
  no                Negate a command or set its defaults
  shutdown          Shutdown the selected interface
  spanning-tree     Spanning Tree Subsystem
  speed             Configure speed operation.
  storm-control     storm configuration
  switchport        Set switching mode characteristics
  tx-ring-limit     Configure PA level transmit ring limit
SW1(config-if-range)#switchport port-security max
SW1(config-if-range)#switchport port-security maximum ?
  <1-132>  Maximum addresses
SW1(config-if-range)#switchport port-security maximum 1
SW1(config-if-range)#switchport port-security ?
  mac-address  Secure mac address
  maximum      Max secure addresses
  violation    Security violation mode
  <cr>
SW1(config-if-range)#switchport port-security sti
SW1(config-if-range)#switchport port-security stic
SW1(config-if-range)#switchport port-security ma
SW1(config-if-range)#switchport port-security mac
SW1(config-if-range)#switchport port-security mac-address st
SW1(config-if-range)#switchport port-security mac-address sticky 
SW1(config-if-range)#switchport port-security vi
SW1(config-if-range)#switchport port-security violation ?
  protect   Security violation protect mode
  restrict  Security violation restrict mode
  shutdown  Security violation shutdown mode
SW1(config-if-range)#switchport port-security violation res
SW1(config-if-range)#switchport port-security violation restrict ?
  <cr>
SW1(config-if-range)#switchport port-security violation restrict 
SW1(config-if-range)#end
SW1#
%SYS-5-CONFIG_I: Configured from console by console

SW1#sh run
Building configuration...

Current configuration : 1543 bytes
!
version 12.2
no service timestamps log datetime msec
no service timestamps debug datetime msec
service password-encryption
!
hostname SW1
!
enable secret 5 $1$mERr$824CE5IovOGhpZXVDz/bc0
enable password 7 0822455D0A16
!
!
!
!
!
spanning-tree mode pvst
!
interface FastEthernet0/1
!
interface FastEthernet0/2
!
interface FastEthernet0/3
!
interface FastEthernet0/4
!
interface FastEthernet0/5
 switchport mode access
 switchport port-security
 switchport port-security mac-address sticky 
 switchport port-security violation restrict 
!
interface FastEthernet0/6
 switchport mode access
 switchport port-security
 switchport port-security mac-address sticky 
 switchport port-security violation restrict 
!


SW2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
SW2(config)#interface fa0/5
SW2(config-if)#switchport port-security violation restrict 
SW2(config-if)#switchport mode access
SW2(config-if)#switchport por
SW2(config-if)#switchport port-security max
SW2(config-if)#switchport port-security maximum 1
SW2(config-if)#switchport port-security mac
SW2(config-if)#switchport port-security mac-address st
SW2(config-if)#switchport port-security mac-address sticky 
SW2(config-if)#switchport port-security vi
SW2(config-if)#switchport port-security violation re
SW2(config-if)#switchport port-security violation restrict 
SW2(config-if)#end
SW2#
%SYS-5-CONFIG_I: Configured from console by console

SW2#


## If the violation is set to "shutdown" all devices on this port
## will lose connectivity as the port will be off and requires a 
## "shut" and "no shut" on the shutdown interface
## Simulate Port Security  by adding a new device on the secured port
## with a IP within the same subnet and then try to reach the Router GW
## An immediate "shutdown" occurs and a "shut" "noshut" will fix it
## "restrict" is recommended over "shutdown"

SW2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
SW2(config)#switchport port-security violation ?
% Unrecognized command
SW2(config)#interface fa0/5
SW2(config-if)#switchport port-security violation ?
  protect   Security violation protect mode
  restrict  Security violation restrict mode
  shutdown  Security violation shutdown mode
SW2(config-if)#switchport port-security violation shutdown 
SW2(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/5, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/5, changed state to down

%LINK-5-CHANGED: Interface FastEthernet0/5, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/5, changed state to up

SW2(config-if)#switchport port-security violation shutdown 
%LINK-5-CHANGED: Interface FastEthernet0/5, changed state to administratively down

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/5, changed state to down

SW2(config-if)#shut 

%LINK-5-CHANGED: Interface FastEthernet0/5, changed state to administratively down
SW2(config-if)#no shut

SW2(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/5, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/5, changed state to up

## Configure VLANs

SW1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
SW1(config)#vlan 2
SW1(config-vlan)#name SALES
SW1(config-vlan)#exit
SW1(config)#
%LINK-5-CHANGED: Interface FastEthernet0/8, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/8, changed state to up

SW1(config)#int fa0/8
SW1(config-if)#swi
SW1(config-if)#switchport por
SW1(config-if)#switchport port-security ac
SW1(config-if)#switchport port-security acc
SW1(config-if)#switchport port-security acce
SW1(config-if)#swit
SW1(config-if)#switchport ac
SW1(config-if)#switchport access vla
SW1(config-if)#switchport access vlan 2
SW1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
SW1(config)#int fa0/10
SW1(config-if)#sw
SW1(config-if)#switchport mod
SW1(config-if)#switchport mode ?
  access   Set trunking mode to ACCESS unconditionally
  dynamic  Set trunking mode to dynamically negotiate access or trunk mode
  trunk    Set trunking mode to TRUNK unconditionally
SW1(config-if)#switchport mode tru
SW1(config-if)#switchport mode trunk 

SW1(config-if)#
%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/10, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/10, changed state to up

SW1(config-if)#
SW1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
SW1(config)#vlan 7
SW1(config-vlan)#int fa0/11
SW1(config-if)#sw
SW1(config-if)#switchport ac
SW1(config-if)#switchport access val
SW1(config-if)#switchport access vla
SW1(config-if)#switchport access vlan 7
SW1(config-if)#exit
SW1(config)#vlan 7
SW1(config-vlan)#name MARKETING
SW1(config-vlan)#exit
SW1(config)#int fa0/11 
SW1(config-if)#sw
SW1(config-if)#switchport ac
SW1(config-if)#switchport access vlan 7
SW1(config-if)#



SW2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
SW2(config)#vlan 2
SW2(config-vlan)#name SALES
SW2(config-vlan)#exit
SW2(config)#int
%LINK-5-CHANGED: Interface FastEthernet0/9, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/9, changed state to up

% Incomplete command.
SW2(config)#swi
SW2(config)#switc
SW2(config)#int fa0/9
SW2(config-if)#swit
SW2(config-if)#switchport ac
SW2(config-if)#switchport access vla
SW2(config-if)#switchport access vlan 2


SW2#sh vlan 

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Fa0/1, Fa0/2, Fa0/3, Fa0/4
                                                Fa0/5, Fa0/6, Fa0/7, Fa0/8
                                                Fa0/10, Fa0/11, Fa0/12, Fa0/13
                                                Fa0/14, Fa0/15, Fa0/16, Fa0/17
                                                Fa0/18, Fa0/19, Fa0/20, Fa0/21
                                                Fa0/22, Fa0/23, Fa0/24, Gig0/1
                                                Gig0/2
2    SALES                            active    Fa0/9
1002 fddi-default                     act/unsup 
1003 token-ring-default               act/unsup 
1004 fddinet-default                  act/unsup 
1005 trnet-default                    act/unsup 

VLAN Type  SAID       MTU   Parent RingNo BridgeNo Stp  BrdgMode Trans1 Trans2
---- ----- ---------- ----- ------ ------ -------- ---- -------- ------ ------
1    enet  100001     1500  -      -      -        -    -        0      0
2    enet  100002     1500  -      -      -        -    -        0      0
1002 fddi  101002     1500  -      -      -        -    -        0      0   
1003 tr    101003     1500  -      -      -        -    -        0      0   
1004 fdnet 101004     1500  -      -      -        ieee -        0      0   
1005 trnet 101005     1500  -      -      -        ibm  -        0      0   

Remote SPAN VLANs
------------------------------------------------------------------------------


Primary Secondary Type              Ports
------- --------- ----------------- ------------------------------------------
SW2#

SW2#
%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/10, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/10, changed state to up

SW2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
SW2(config)#int fa0/10
SW2(config-if)#sw
SW2(config-if)#switchport mod
SW2(config-if)#switchport mode tr
SW2(config-if)#switchport mode trunk 
SW2(config-if)#
SW2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
SW2(config)#swit
SW2(config)#vlan 7
SW2(config-vlan)#name MARKETING
SW2(config-vlan)#exit
SW2(config)#int fa0/11
SW2(config-if)#sw
SW2(config-if)#switchport ac
SW2(config-if)#switchport access vlan 7
SW2(config-if)#no switchport access vlan 7
SW2(config-if)#exit
SW2(config)#int fa0/12
SW2(config-if)#switchport access vlan 7

## Subnetting with Tool #1 and Tool #2 MN

192.168.4.70 /26 mn = 64
255.255.255.192 [STEP 1] = Mask
192.168.4.64 [STEP 2] = Network ID "64" derived by 70/64 = approx. 1 and 64*1=64
192.168.4.(64 + 1) = 192.168.4.65 = First Valid +0.0.0.1
192.168.4.(127 - 1) = 192.168.4.126 = Last Valid -0.0.0.1 
192.168.4.(128 - 1) = 192.168.4.127 = Broadcast  IP -0.0.0.1
192.168.4.(64 + mn) = 192.168.4.128
/32 - /26 = 6 
2^6 = 64 - 2 = 62 Hosts 

192.168.1.42 / 29   mn = 8
255.255.255.248
192.168.1.40 and "40" = 42 / 8 = 5 and 5*8
192.168.1.(40 + 1) = 192.168.41 = First Valid
192.168.1.(47 - 1) = 192.168.1.46 = Last Valid
192.168.1.(48 - 1) = 192.168.1.47 = Broadcast IP 
192.168.1.(40 + mn) = 192.168.1.48
/32 - /29 = 3 
2^3 = 8 - 2 = 6 Hosts


192.168.23.61 /28   mn = 16
255.255.255.240
192.168.23.48  (61 / 16 = 3 and 3*16 = 48)
192.168.23.49 First 
192.168.23.62 Last
192.168.23.63 Broadcast
192.168.23.64 (48 + 16) Next Address/Subnet

172.16.159.159 /22  mn = 4
255.255.252.0 
172.16.156.0 (159 / 4 = 39*4) = 156
172.16.156.0 + 0.0.0.1 = 172.16.156.1 First Valid
172.16.159.255 - 0.0.0.1 = 172.16.159.254 Last Valid
172.16.160.0 - 0.0.0.1 = 172.16.159.255 Broadcast
172.16.(156 + 4).0 = 172.16.160.0
/32 - /22 = 10
2^10 = 1024 - 2 = 1022 Hosts

172.19.20.23 /28  mn = 16
255.255..255.240
172.19.20.16 (23 / 16 = 1*16) = 16
172.19.20.17 First Valid
172.19.20.30 Last Valid
172.19.20.31 Broadcast 
172.19.20.(16 + 16) = 172.16.20.32 Next Address
/32 - /28 = 4
2^4 = 16 - 2 = 14 Hosts

10.16.3.65 /23  mn = 2
255.255.254.0  
10.16.2.0 (3 / 2 = 1*2) = 2
10.16.2.1 First Valid
10.16.3.254 Last Valid
10.16.3.255 = Broadcast
10.16.(2 + 2).0 = 10.16.4.0 Next Address

How many hosts? 
/23 = 111111111.111111111.111111110.0000000 
"23" ones and "9" zeros = "32" places total
/32 - /23 
2^9 = 512 - 2 = 510 Hosts


