

Router>enable
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#hostname R1
R1(config)#
R1(config)#end
R1#copy running-config startup-config
Destination filename [startup-config]? 
Building configuration...
[OK]
R1#
%SYS-5-CONFIG_I: Configured from console by console

R1#en
R1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#ipv6
R1(config)#ipv6 un
R1(config)#ipv6 unicast-routing 
R1(config)#int gi0/0
R1(config-if)#?
  arp                Set arp type (arpa, probe, snap) or timeout
  bandwidth          Set bandwidth informational parameter
  cdp                CDP interface subcommands
  channel-group      Add this interface to an Etherchannel group
  crypto             Encryption/Decryption commands
  custom-queue-list  Assign a custom queue list to an interface
  delay              Specify interface throughput delay
  description        Interface specific description
  duplex             Configure duplex operation.
  exit               Exit from interface configuration mode
  fair-queue         Enable Fair Queuing on an Interface
  hold-queue         Set hold queue depth
  ip                 Interface Internet Protocol config commands
  ipv6               IPv6 interface subcommands
  mac-address        Manually set interface MAC address
  mtu                Set the interface Maximum Transmission Unit (MTU)
  no                 Negate a command or set its defaults
  pppoe              pppoe interface subcommands
  priority-group     Assign a priority group to an interface
  service-policy     Configure QoS Service Policy
  shutdown           Shutdown the selected interface
  speed              Configure speed operation.
  standby            HSRP interface configuration commands
  tx-ring-limit      Configure PA level transmit ring limit
R1(config-if)#
R1(config-if)#ipv
R1(config-if)#ipv6 ?
  address          Configure IPv6 address on interface
  authentication   authentication subcommands
  dhcp             IPv6 DHCP interface subcommands
  eigrp            Configure EIGRP IPv6 on interface
  enable           Enable IPv6 on interface
  flow             NetFlow Related commands
  hello-interval   Configures IP-EIGRP hello interval
  mtu              Set IPv6 Maximum Transmission Unit
  nat              Enable IPv6 NAT on interface
  nd               IPv6 interface Neighbor Discovery subcommands
  ospf             OSPF interface commands
  rip              Configure RIP routing protocol
  summary-address  Summary prefix
  traffic-filter   Access control list for packets
R1(config-if)#ipv6 ad
R1(config-if)#ipv6 address ?
  WORD                General prefix name
  X:X:X:X::X          IPv6 link-local address
  X:X:X:X::X/<0-128>  IPv6 prefix
  autoconfig          Obtain address using autoconfiguration
R1(config-if)#ipv6 address 2001:db8:1111:1::1/64
R1(config-if)#no shut

R1(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0, changed state to up

R1(config-if)#int s0/0
%Invalid interface type and number
R1(config)#int s0]
                  ^
% Invalid input detected at '^' marker.
	
R1(config)#exit
R1#
%SYS-5-CONFIG_I: Configured from console by console
sh ip int br
Interface              IP-Address      OK? Method Status                Protocol
 
GigabitEthernet0/0     unassigned      YES unset  up                    up
 
GigabitEthernet0/1     unassigned      YES unset  administratively down down
 
GigabitEthernet0/2     unassigned      YES unset  administratively down down
 
Serial0/0/0            unassigned      YES unset  administratively down down
 
Serial0/0/1            unassigned      YES unset  administratively down down
 
Vlan1                  unassigned      YES unset  administratively down down
R1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#int s0/0/0
R1(config-if)#exit
R1(config)#exit
R1#
%SYS-5-CONFIG_I: Configured from console by console

R1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#int s0/0/0
R1(config-if)#ipv
R1(config-if)#ipv6 ad
R1(config-if)#ipv6 address 2001:db:1111:4::1/64
R1(config-if)#no shut

R1(config-if)#
%LINK-5-CHANGED: Interface Serial0/0/0, changed state to up

R1(config-if)#int s0/0/1
R1(config-if)#
%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/0/0, changed state to up

R1(config-if)#ipv6 address 2001:db:1111:5::1/64
R1(config-if)#
R1(config-if)#no shut

R1(config-if)#
%LINK-5-CHANGED: Interface Serial0/0/1, changed state to up

R1(config-if)#
%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/0/1, changed state to up

R1(config-if)#end
R1#
%SYS-5-CONFIG_I: Configured from console by console

R1#sh ip int br
R1#sh ip int brief 
Interface              IP-Address      OK? Method Status                Protocol
 
GigabitEthernet0/0     unassigned      YES unset  up                    up
 
GigabitEthernet0/1     unassigned      YES unset  administratively down down
 
GigabitEthernet0/2     unassigned      YES unset  administratively down down
 
Serial0/0/0            unassigned      YES unset  up                    up
 
Serial0/0/1            unassigned      YES unset  up                    up
 
Vlan1                  unassigned      YES unset  administratively down down
R1#sh ipv
R1#sh ipv6 int br
GigabitEthernet0/0         [up/up]
    FE80::260:47FF:FE81:C101
    2001:DB8:1111:1::1
GigabitEthernet0/1         [administratively down/down]
GigabitEthernet0/2         [administratively down/down]
Serial0/0/0                [up/up]
    FE80::260:47FF:FE81:C101
    2001:DB:1111:4::1
Serial0/0/1                [up/up]
    FE80::260:47FF:FE81:C101
    2001:DB:1111:5::1
Vlan1                      [administratively down/down]


R1#sh ipv6 interface 
%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/0/1, changed state to up

GigabitEthernet0/0 is up, line protocol is up
  IPv6 is enabled, link-local address is FE80::260:47FF:FE81:C101
  No Virtual link-local address(es):
  Global unicast address(es):
    2001:DB8:1111:1::1, subnet is 2001:DB8:1111:1::/64
  Joined group address(es):
    FF02::1
    FF02::2
    FF02::1:FF00:1
    FF02::1:FF81:C101


## "Joined group addresses" are UNICAST Addresses

R1(config)#ipv
R1(config)#ipv6 rou
R1(config)#ipv6 rout
R1(config)#ipv6 route
R1(config)#ipv6 router
R1(config)#ipv6 router os
R1(config)#ipv6 router ospf 1
%OSPFv3-4-NORTRID: OSPFv3 process 1 could not pick a router-id,please configure manually
R1(config-rtr)#route-
R1(config-rtr)#route-d
R1(config-rtr)#route-i
R1(config-rtr)#router-
R1(config-rtr)#router-id 
R1(config-rtr)#router-id 1.1.1.1
R1(config-rtr)#int gi0/0
R1(config-if)#ipv
R1(config-if)#ipv6 os
R1(config-if)#ipv6 ospf 1 are
R1(config-if)#ipv6 ospf 1 area 0
R1(config-if)#int s0/0/0
R1(config-if)#ipv6 ospf 1 area 0
R1(config-if)#int s0/0/1
R1(config-if)#ipv6 ospf 1 area 0
R1(config-if)#
00:49:25: %OSPFv3-5-ADJCHG: Process 1, Nbr 2.2.2.2 on Serial0/0/0 from LOADING to FULL, Loading Done

00:50:54: %OSPFv3-5-ADJCHG: Process 1, Nbr 3.3.3.3 on Serial0/0/1 from LOADING to FULL, Loading Done

R1(config-if)#end
R1#
%SYS-5-CONFIG_I: Configured from console by console
a
% Incomplete command.
R1#sh osf
R1#sh os
R1#sh ro
R1#sh ip
R1#sh ipv
R1#sh ipv6 r
R1#sh ipv6 r
R1#sh ip os
R1#sh ipv
R1#sh ipv6 os
R1#sh ipv6 ospf ne
R1#sh ipv6 ospf neighbor 

Neighbor ID     Pri   State           Dead Time   Interface ID    Interface
2.2.2.2           0   FULL/  -        00:00:34    4               Serial0/0/0
3.3.3.3           0   FULL/  -        00:00:38    4               Serial0/0/1
R1#sh ipv6 ospf r
R1#sh ipv6 ro
R1#sh ipv6 route 
IPv6 Routing Table - 9 entries
Codes: C - Connected, L - Local, S - Static, R - RIP, B - BGP
       U - Per-user Static route, M - MIPv6
       I1 - ISIS L1, I2 - ISIS L2, IA - ISIS interarea, IS - ISIS summary
       O - OSPF intra, OI - OSPF inter, OE1 - OSPF ext 1, OE2 - OSPF ext 2
       ON1 - OSPF NSSA ext 1, ON2 - OSPF NSSA ext 2
       D - EIGRP, EX - EIGRP external
C   2001:DB8:1111:1::/64 [0/0]
     via GigabitEthernet0/0, directly connected
L   2001:DB8:1111:1::1/128 [0/0]
     via GigabitEthernet0/0, receive
O   2001:DB8:1111:2::/64 [110/65]
     via FE80::260:70FF:FE73:4B01, Serial0/0/0
O   2001:DB8:1111:3::/64 [110/65]
     via FE80::20D:BDFF:FE77:7C01, Serial0/0/1
C   2001:DB8:1111:4::/64 [0/0]
     via Serial0/0/0, directly connected
L   2001:DB8:1111:4::1/128 [0/0]
     via Serial0/0/0, receive
C   2001:DB8:1111:5::/64 [0/0]
     via Serial0/0/1, directly connected
L   2001:DB8:1111:5::1/128 [0/0]

R1#sh ipv6 ospf ?
  <1-65535>       Process ID number
  border-routers  Border and Boundary Router Information
  database        Database summary
  interface       Interface information
  neighbor        Neighbor list
  virtual-links   Virtual link information
  <cr>
R1#sh ipv6 ospf da
R1#sh ipv6 ospf database 
            OSPF Router with ID (1.1.1.1) (Process ID 1)

                Router Link States (Area 0)

ADV Router      Age         Seq#       Fragment ID  Link count Bits
2.2.2.2         209         0x80000002 0            1          
1.1.1.1         121         0x80000003 0            2          
3.3.3.3         121         0x80000002 0            1          

                Link (Type-8) Link States (Area 0)
ADV Router      Age         Seq#       Link ID    Interface
1.1.1.1         341         0x80000001 1          Gi0/0
1.1.1.1         219         0x80000004 4          Se0/0/0
2.2.2.2         209         0x80000003 4          Se0/0/0
1.1.1.1         125         0x80000005 5          Se0/0/1
3.3.3.3         121         0x80000003 4          Se0/0/1

                Intra Area Prefix Link States (Area 0)
ADV Router      Age         Seq#       Link ID    Ref-lstype  Ref-LSID
1.1.1.1         320         0x80000003 2          0x2001      0
2.2.2.2         218         0x80000002 2          0x2001      0
3.3.3.3         125         0x80000002 2          0x2001      0
R1#








R1 con0 is now available






Press RETURN to get started.












%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/0/1, changed state to down
*Mar 1 01:37:27.720: ICMPv6-ND: Address 2001:DB8:1111:5::1 is down on Serial0/0/1
*Mar 1 01:37:27.720: ICMPv6-ND: Linklocal FE80::260:47FF:FE81:C101 on Serial0/0/1, Down
*Mar 1 01:37:27.720: ICMPv6-ND: Address FE80::260:47FF:FE81:C101 is down on Serial0/0/1
*Mar 1 01:37:27.720: ICMPv6-ND: Sending RA from FE80::260:47FF:FE81:C101 to FF02::1 on Serial0/0/1
*Mar 1 01:37:27.720: ICMPv6-ND:     MTU = 1500
*Mar 1 01:37:27.720: ICMPv6-ND:     prefix = 2001:DB8:1111:5::/64 onlink autoconfig
*Mar 1 01:37:27.720: ICMPv6-ND:             2592000/604800 (valid/preferred)

01:37:27: %OSPFv3-5-ADJCHG: Process 1, Nbr 3.3.3.3 on Serial0/0/1 from FULL to DOWN, Neighbor Down: Interface down or detached

%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/0/0, changed state to down
*Mar 1 01:37:27.725: ICMPv6-ND: Address 2001:DB8:1111:4::1 is down on Serial0/0/0
*Mar 1 01:37:27.725: ICMPv6-ND: Linklocal FE80::260:47FF:FE81:C101 on Serial0/0/0, Down
*Mar 1 01:37:27.725: ICMPv6-ND: Address FE80::260:47FF:FE81:C101 is down on Serial0/0/0
*Mar 1 01:37:27.725: ICMPv6-ND: Sending RA from FE80::260:47FF:FE81:C101 to FF02::1 on Serial0/0/0
*Mar 1 01:37:27.725: ICMPv6-ND:     MTU = 1500
*Mar 1 01:37:27.725: ICMPv6-ND:     prefix = 2001:DB8:1111:4::/64 onlink autoconfig
*Mar 1 01:37:27.725: ICMPv6-ND:             2592000/604800 (valid/preferred)

01:37:27: %OSPFv3-5-ADJCHG: Process 1, Nbr 2.2.2.2 on Serial0/0/0 from FULL to DOWN, Neighbor Down: Interface down or detached

%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/0/0, changed state to up
*Mar 1 01:37:27.705: ICMPv6-ND: Address 2001:DB8:1111:4::1 is up on Serial0/0/0
*Mar 1 01:37:27.705: ICMPv6-ND: Linklocal FE80::260:47FF:FE81:C101 on Serial0/0/0, Up
*Mar 1 01:37:27.705: ICMPv6-ND: Address FE80::260:47FF:FE81:C101 is up on Serial0/0/0
*Mar 1 01:37:27.705: ICMPv6-ND: Sending RA from FE80::260:47FF:FE81:C101 to FF02::1 on Serial0/0/0
*Mar 1 01:37:27.705: ICMPv6-ND:     MTU = 1500
*Mar 1 01:37:27.705: ICMPv6-ND:     prefix = 2001:DB8:1111:4::/64 onlink autoconfig
*Mar 1 01:37:27.705: ICMPv6-ND:             2592000/604800 (valid/preferred)

%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/0/1, changed state to up
*Mar 1 01:37:27.708: ICMPv6-ND: Address 2001:DB8:1111:5::1 is up on Serial0/0/1
*Mar 1 01:37:27.708: ICMPv6-ND: Linklocal FE80::260:47FF:FE81:C101 on Serial0/0/1, Up
*Mar 1 01:37:27.708: ICMPv6-ND: Address FE80::260:47FF:FE81:C101 is up on Serial0/0/1
*Mar 1 01:37:27.708: ICMPv6-ND: Sending RA from FE80::260:47FF:FE81:C101 to FF02::1 on Serial0/0/1
*Mar 1 01:37:27.708: ICMPv6-ND:     MTU = 1500
*Mar 1 01:37:27.708: ICMPv6-ND:     prefix = 2001:DB8:1111:5::/64 onlink autoconfig
*Mar 1 01:37:27.708: ICMPv6-ND:             2592000/604800 (valid/preferred)

01:37:37: %OSPFv3-5-ADJCHG: Process 1, Nbr 2.2.2.2 on Serial0/0/0 from LOADING to FULL, Loading Done

01:37:37: %OSPFv3-5-ADJCHG: Process 1, Nbr 3.3.3.3 on Serial0/0/1 from LOADING to FULL, Loading Done


R1>en
R1#u all
