## ACL Lab ##

## Changed temporarily to never lock the console 

R1#conf t 
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#lin con 0 
R1(config-line)#exec tim
R1(config-line)#exec time
R1(config-line)#exec time
R1(config-line)#exec timeo
R1(config-line)#exec-
R1(config-line)#exec-timeout 0 0
R1(config-line)#end
R1#
%SYS-5-CONFIG_I: Configured from console by console

R1#sh access-lists 
Standard IP access list 10
    10 permit host 192.168.3.3
Extended IP access list 120
    10 permit udp any host 192.168.1.3 eq domain
    20 permit tcp any host 192.168.1.3 eq smtp
    30 permit tcp any host 192.168.1.3 eq ftp
    40 deny tcp any host 192.168.1.3 eq 443
    50 permit tcp host 192.168.3.3 host 10.1.1.1 eq 22
    60 permit icmp any any echo-reply
    70 permit icmp any any unreachable
    80 deny icmp any any
    90 permit ip any any

## With traffic generator ACLs are triggered
R1#sh access-lists 
Standard IP access list 10
    10 permit host 192.168.3.3 (6 match(es))
Extended IP access list 120
    10 permit udp any host 192.168.1.3 eq domain (5 match(es))
    20 permit tcp any host 192.168.1.3 eq smtp (24 match(es))
    30 permit tcp any host 192.168.1.3 eq ftp (6 match(es))
    40 deny tcp any host 192.168.1.3 eq 443 (48 match(es))
    50 permit tcp host 192.168.3.3 host 10.1.1.1 eq 22 (85 match(es))
    60 permit icmp any any echo-reply
    70 permit icmp any any unreachable
    80 deny icmp any any (4 match(es))
    90 permit ip any any (12 match(es))


## Class B Private IP Addresses

access-list 100 deny ip 172.16.0.0 0.15.255.255 any

## Calculation will be done later

## Configure R3

R3#sh access-lists 
Standard IP access list 10
    10 permit host 192.168.3.3
Extended IP access list 100
    10 deny ip 10.0.0.0 0.255.255.255 any
    20 deny ip 172.16.0.0 0.15.255.255 any
    30 deny ip 192.168.0.0 0.0.255.255 any
    40 deny ip 127.0.0.0 0.255.255.255 any
    50 deny ip 224.0.0.0 15.255.255.255 any
    60 permit ip any any
Extended IP access list 110
    10 permit ip 192.168.3.0 0.0.0.255 any

## Validate from R1 to R3 traffic 

R1#sh ip int br
Interface              IP-Address      OK? Method Status                Protocol
 
FastEthernet0/0        unassigned      YES unset  administratively down down
 
FastEthernet0/1        192.168.1.1     YES manual up                    up
 
Serial0/0/0            10.1.1.1        YES manual up                    up
 
Serial0/0/1            unassigned      YES unset  administratively down down
 
Vlan1                  unassigned      YES unset  administratively down down
R1#ping 192.168.3.3

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 192.168.3.3, timeout is 2 seconds:
.....
Success rate is 0 percent (0/5)


R3#sh access-lists 
Standard IP access list 10
    10 permit host 192.168.3.3
Extended IP access list 100
    10 deny ip 10.0.0.0 0.255.255.255 any (654 match(es))
    20 deny ip 172.16.0.0 0.15.255.255 any
    30 deny ip 192.168.0.0 0.0.255.255 any
    40 deny ip 127.0.0.0 0.255.255.255 any
    50 deny ip 224.0.0.0 15.255.255.255 any
    60 permit ip any any
Extended IP access list 110
    10 permit ip 192.168.3.0 0.0.0.255 any (16 match(es))


## 654 matches as the interface on R1 has 10.1.1.1


